{
    "business": {
        "name": "Bedaya Hospital",
        "rating": 4.5
    },
    "reviews": [
        {
            "author_name": "Ghanim Ataia",
            "author_url": "https:\/\/www.google.com\/maps\/contrib\/115228289816271405845\/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https:\/\/lh3.googleusercontent.com\/a\/ACg8ocL4Rs_kJDXP0xVDatQd88943FqT1Q1LGBw1CFFswzFW8S13fQ=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "6 months ago",
            "text": "Very poor experience.\nAlthough the joy of having child is every couples dream however it should not be take advantage of to generate money and take advantage of couples seeking to conceive.\n\nMy experience today has been very poor. I had sperm collection after hours due to Ramadan. After coming for my scheduled appointment my file was not in the reception.\n\nFurther more I have been asked why I am here and what type of test. Clearly they had no idea and 0 communication between departments. I have advised them I have an appointment for sperm collection. Further more I have been asked is it to freeze or to do test. I have advised I am not sure. Very much a guessing game.\n\nI have been instructed to wait get a ticket from the machine and to wait which I did my ticket number 502. After more than an hour I came to the reception they told me we called your number I did not leave the waiting room cafe. Anyways I have been given the usual paper to pay for the sperm collection at this stage the time is past 10 pm and they close at 11 pm.\n\nThe cashier asked me to pay 3850 pounds. I only had 3000 cash in my pocket and I was short 850 pounds. I was not prepared for this and I had no prior knowledge of the cost. I told him please take the 3000 and tomorrow we have appointment with doctor Mohamed and we can pay the difference he refused. I told him we have pre paid over 55,000 pounds in our account for the surgery and to take the amount from it and he still refused .\nHe washed me away and asked my to go to reception an attitude that makes you feel humiliated I kept my cool and went to reception of which he send me back to him  at the cashier. Back and forth between the two over 850 pounds. He clearly dismissed me and said sorry it is my system you can’t do the test sorry I need the rest of the money because they close .\n\nI told him I have the money but it is inconvenient to go and come back . He said you have 30 min go and com back and bring me 800 pounds. I said I want to speak to your manager he said I am the manager here no one else. I told him very well we don’t want to proceed with the surgery and to refund us our 55,000 pounds he said I can’t till you come in the morning.\n\nAll this over 850 pounds. I went to reception again he was very helpful and told me the cashier said he will pay me from his pocket I told him excuse me I do not need his charity and he has no respect for patients who go through stressful situations going through this process.\n\nManagement need to step in and improve patients experience after hours. No escalation process after hours for a hospital this size is very poor. It feels like one man show after hours.\n\nI don’t recommend this hospital all though they have great doctors however worst administrators and cashiers",
            "time": 1742352650,
            "translated": false
        },
        {
            "author_name": "Engr.Muhammad khan",
            "author_url": "https:\/\/www.google.com\/maps\/contrib\/106867347303772804378\/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https:\/\/lh3.googleusercontent.com\/a-\/ALV-UjXtuO50lzcg7_AqUsrL4pQIZGfLuNLMFm1oN8aln9bf-xE2tjlU=s128-c0x00000000-cc-rp-mo",
            "rating": 3,
            "relative_time_description": "a month ago",
            "text": "I just want to ask how the lab procedure works. Is it safe to ensure that samples don't get mixed up with each other?",
            "time": 1754935610,
            "translated": false
        },
        {
            "author_name": "Ahmed mraidi",
            "author_url": "https:\/\/www.google.com\/maps\/contrib\/108861748101691365039\/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https:\/\/lh3.googleusercontent.com\/a\/ACg8ocKj50eIv5Vkbt56-PzyH7WhSpqMebmwu_RbKWMQLaOL-IB-Kw=s128-c0x00000000-cc-rp-mo",
            "rating": 1,
            "relative_time_description": "a month ago",
            "text": "as a foreign i really find it soI dealt with customer service, and they were unclear and unprofessional, I do not advise any foreigner to deal with them, there are other clinics that are clear and do not want to exploit people, but these will exploit you as a foreigner and their goal is to pay , but nothing clear .",
            "time": 1753175244,
            "translated": false
        },
        {
            "author_name": "Almasry Caps",
            "author_url": "https:\/\/www.google.com\/maps\/contrib\/108042147942345552471\/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https:\/\/lh3.googleusercontent.com\/a-\/ALV-UjUTQc_7DFpqjYVp5eBieA9oWyATK0NdoTU5lFxXYqyp3unTnp5p=s128-c0x00000000-cc-rp-mo-ba2",
            "rating": 5,
            "relative_time_description": "a month ago",
            "text": "Thank you Bedaya & Thanks Dr. Ismail for the great support and professionalism!!",
            "time": 1753966823,
            "translated": false
        },
        {
            "author_name": "Adil Timimi",
            "author_url": "https:\/\/www.google.com\/maps\/contrib\/107560910586021528124\/reviews",
            "language": "en",
            "original_language": "en",
            "profile_photo_url": "https:\/\/lh3.googleusercontent.com\/a\/ACg8ocLwWGb3M-F9a2tY67Dtqa5cpnRsaMkmatKRDY1vAzkC7cOLaw=s128-c0x00000000-cc-rp-mo",
            "rating": 5,
            "relative_time_description": "a year ago",
            "text": "Amazing IVF\/ ICSI hospital, very professional and helpful team. They are with you all the way. A million thanks to the hospital. Keep up the amazing works",
            "time": 1702478179,
            "translated": false
        }
    ]
}